Revit 2027 API
ExportLinetypeInfo(ExportLinetypeInfo) Constructor
 Constructs a new copy of the input ExportLinetypeInfo object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExportLinetypeInfo(
	ExportLinetypeInfo other
)
Public Sub New (
	other As ExportLinetypeInfo
)
public:
ExportLinetypeInfo(
	ExportLinetypeInfo^ other
)
new :
        other : ExportLinetypeInfo -> ExportLinetypeInfo
Parameters
other ExportLinetypeInfo
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportLinetypeInfo Class
ExportLinetypeInfo Overload
Autodesk.Revit.DB Namespace